function postTextForComrades(num) {
  let text = "Товарищи, ";
  for (let j = 0; j < num; j++) {
    for (let i = 0; i < arr.length; i++) {
      if (!(j == 0 && i == 0))
        text = text + arr[i][getRandomInt(arr[i].length - 1)];
      if (!(i + 1 >= arr.length)) {
        text += " ";
      }
    }
    text += ". ";
    document.querySelector(".generated-text__text").innerHTML = text;
  }
}

function getRandomInt(max) {
  return Math.floor(Math.random() * max);
}
// массив с элементами текста
// добавить вариативность текста из отдельного файла
const arr = [
  [
    "С другой стороны,",
    "Равным образом",
    "Не следует, однако, забывать, что",
    "Таким образом,",
    "Повседневная практика показывает, что",
  ],
  [
    "реализация намеченных плановых заданий",
    "рамки и место обучения кадров",
    "постоянный количественный рост и сфера нашей активности",
    "сложившаяся структура организации",
    "новая модель организационной деятельности",
    "дальнейшее развитие различных форм деятельности",
  ],
  [
    "играет важную роль в формировании",
    "требуют от наз анализа",
    "требуют определения и уточнения",
    "способствует подготовке и реализации",
    "обеспечивает широкому кругу специалистов участие в формировании",
    "позволяет выполнить выжные задания по разработке",
  ],
  [
    "существенных финансовых и административных условий",
    "дальнейших направлений развития",
    "системы массового участия",
    "позиций, занимаемых участниками в отношении поставленных задач",
    "новых предложений",
    "направлений прогрессивного развития",
  ],
];
